In [3]:
import numpy as np
import pandas as pd

### 산술 연산

In [4]:
data = {'eng': [10, 30, 50, 70],
       'kor': [20, 40 ,60 , 80],
       'math': [90, 50, 20, 70]}
df = pd.DataFrame(data, index=['a', 'b', 'c', 'd'])
df

   eng  kor  math
a   10   20    90
b   30   40    50
c   50   60    20
d   70   80    70

In [9]:
# 모든 요소에 대해 연산
df + 1

   eng  kor  math
a   11   21    91
b   31   41    51
c   51   61    21
d   71   81    71

In [11]:
# 특정 컬럼에 대해 연산 
df['eng'] = df['eng'] + 1
df

   eng  kor  math
a   11   20    90
b   31   40    50
c   51   60    20
d   71   80    70

In [13]:
# 특정 행에 대해 연산
df.iloc[0] = df.iloc[0] + 1
df

   eng  kor  math
a   12   21    91
b   31   40    50
c   51   60    20
d   71   80    70

In [14]:
# boolean indexing
# 행 개수와 조건이 같아야 한다.
df[[True, False, True, False]]

   eng  kor  math
a   12   21    91
c   51   60    20

In [15]:
# 컬럼에 조건 
# 조건 만족하는 행 추출
df[df['eng'] > 30]

   eng  kor  math
b   31   40    50
c   51   60    20
d   71   80    70

### 관계, 논리 연산

In [16]:
df.query('eng > 30')

   eng  kor  math
b   31   40    50
c   51   60    20
d   71   80    70

In [19]:
df.query('kor == 40 | kor == 60')

   eng  kor  math
b   31   40    50
c   51   60    20

In [21]:
df.query('20 <= kor <= 60')

   eng  kor  math
a   12   21    91
b   31   40    50
c   51   60    20

In [23]:
df[df.isin({'kor':[21, 40], 'eng':[31, 51]})]

    eng   kor  math
a   NaN  21.0   NaN
b  31.0  40.0   NaN
c  51.0   NaN   NaN
d   NaN   NaN   NaN

In [28]:
df[df['kor'].isin((40, 60))]

   eng  kor  math
b   31   40    50
c   51   60    20

In [20]:
df[(df['kor'] == 40) | (df['kor'] == 60)]

   eng  kor  math
b   31   40    50
c   51   60    20

In [26]:
df[df['kor'].between(20, 60)]

   eng  kor  math
a   12   21    91
b   31   40    50
c   51   60    20